Revit 2026 API

# RebarHostDataIsValidHost Method

---

Reports whether the element is a valid rebar host.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidHost()
```
```vb
Public Function IsValidHost As Boolean
```
```cpp
public:
bool IsValidHost()
```
```fsharp
member IsValidHost : unit -> bool
```

#### Return Value

Boolean True if the referenced Element can currently host Rebar elements, false otherwise.

If GetRebarHostData() returns a RebarHostData object, but RebarHostData.IsValidHost() returns false, this means that the element can be made a valid rebar host, generally by setting a property like FLOOR_PARAM_IS_STRUCTURAL or by changing the element's physical material to concrete. On the other hand, if GetRebarHostData() returns , the element cannot be made into a rebar host.

#### Reference

RebarHostData Class

IsValidHost Overload

Autodesk.Revit.DB.Structure Namespace